module.exports.config = {
  name: "bot",
  version: "1.0.0",
  hasPermission: 0,
  credits: "𝐒𝐡𝐚𝐡𝐚𝐝𝐚𝐭 𝐈𝐬𝐥𝐚𝐦",
  description: "Random fun reply when someone says Bot",
  commandCategory: "Fun",
  usages: "[Bot]",
  cooldowns: 2,
};

const botReplies = [
  "বেশি bot Bot করলে leave নিবো কিন্তু😒😒",
 "শুনবো না😼 তুমি আমার বস আইভার কে প্রেম করাই দাও নাই🥺পচা তুমি🥺",
 "আমি আবাল দের সাথে কথা বলি না,ok😒",
 "এতো ডেকো না,প্রেম এ পরে যাবো তো🙈",
 "Bolo Babu, তুমি কি আমার বস আইভার কে ভালোবাসো? 🙈💋",
 "বার বার ডাকলে মাথা গরম হয়ে যায় কিন্তু😑",
 "হ্যা বলো😒, তোমার জন্য কি করতে পারি😐😑?",
 "এতো ডাকছিস কেন?গালি শুনবি নাকি? 🤬",
 "I love you janu🥰",
 "আরে Bolo আমার জান ,কেমন আছো?😚",
 "Bot বলে অসম্মান করছি,😰😿",
 "Hop beda😾,Boss বল boss😼",
 "চুপ থাক ,নাই তো তোর দাত ভেগে দিবো কিন্তু",
 "আমাকে না ডেকে মেয়ে হলে বস আইভারে'র ইনবক্সে চলে যা 🌚😂 𝐅𝐚𝐜𝐞𝐛𝐨𝐨𝐤 𝐋𝐢𝐧𝐤 : https://www.facebook.com/profile.php?id=100081383671798",
 "Bot না , জানু বল জানু 😘",
 "বার বার Disturb করছিস কোনো😾,আমার আইভারে'র সাথে ব্যাস্ত আছি😋",
 "আরে বলদ এতো ডাকিস কেন🤬",
 "ফর্সা হওয়ার ক্রিম কিনছি -!🙂🐸"
];

module.exports.run = async function ({ api, event }) {
  const reply = botReplies[Math.floor(Math.random() * botReplies.length)];
  api.sendMessage(reply, event.threadID, event.messageID);
};
